avr-rust/avrd/packs/atmega/ATmega644RFR2.atdf
      <value-group caption="" name="CCA_STATUS_bitf">
        <value caption="Channel indicated as busy." name="CCA_BUSY" value="0"/>
        <value caption="Channel indicated as idle." name="CCA_IDLE" value="1"/>
      </value-group>
      <value-group caption="" name="TST_STATUS_bitf">
        <value caption="Test mode is disabled." name="TST_DISABLED" value="0"/>
        <value caption="Test mode is active." name="TST_ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="TRX_STATUS_bitf">
        <value caption="P_ON" name="P_ON" value="0x00"/>
        <value caption="BUSY_RX" name="BUSY_RX" value="0x01"/>
        <value caption="BUSY_TX" name="BUSY_TX" value="0x02"/>
        <value caption="RX_ON" name="RX_ON" value="0x06"/>
        <value caption="TRX_OFF" name="TRX_OFF" value="0x08"/>
        <value caption="PLL_ON" name="PLL_ON" value="0x09"/>
        <value caption="SLEEP" name="SLEEP" value="0x0F"/>
        <value caption="BUSY_RX_AACK" name="BUSY_RX_AACK" value="0x11"/>
        <value caption="BUSY_TX_ARET" name="BUSY_TX_ARET" value="0x12"/>
        <value caption="RX_AACK_ON" name="RX_AACK_ON" value="0x16"/>
        <value caption="TX_ARET_ON" name="TX_ARET_ON" value="0x19"/>
        <value caption="STATE_TRANSITION_IN_PROGRESS" name="STATE_TRANSITION_IN_PROGRESS" value="0x1F"/>
      </value-group>
      <value-group caption="" name="TRAC_STATUS_bitf">
        <value caption="SUCCESS (RX_AACK, TX_ARET)" name="TRAC_SUCCESS" value="0"/>
        <value caption="SUCCESS_DATA_PENDING (TX_ARET)" name="TRAC_SUCCESS_DATA_PENDING" value="1"/>
        <value caption="SUCCESS_WAIT_FOR_ACK (RX_AACK)" name="TRAC_SUCCESS_WAIT_FOR_ACK" value="2"/>
        <value caption="CHANNEL_ACCESS_FAILURE (TX_ARET)" name="TRAC_CHANNEL_ACCESS_FAILURE" value="3"/>
        <value caption="NO_ACK (TX_ARET)" name="TRAC_NO_ACK" value="5"/>
        <value caption="INVALID (RX_AACK, TX_ARET)" name="TRAC_INVALID" value="7"/>
      </value-group>
      <value-group caption="" name="TRX_CMD_bitf">
        <value caption="NOP" name="CMD_NOP" value="0x00"/>
        <value caption="TX_START" name="CMD_TX_START" value="0x02"/>
        <value caption="FORCE_TRX_OFF" name="CMD_FORCE_TRX_OFF" value="0x03"/>
        <value caption="FORCE_PLL_ON" name="CMD_FORCE_PLL_ON" value="0x04"/>
        <value caption="RX_ON" name="CMD_RX_ON" value="0x06"/>
        <value caption="TRX_OFF" name="CMD_TRX_OFF" value="0x08"/>
        <value caption="PLL_ON (TX_ON)" name="CMD_PLL_ON" value="0x09"/>
        <value caption="RX_AACK_ON" name="CMD_RX_AACK_ON" value="0x16"/>
        <value caption="TX_ARET_ON" name="CMD_TX_ARET_ON" value="0x19"/>
      </value-group>
      <value-group caption="" name="TX_PWR_bitf">
        <value caption="3.5 dBm" name="VAL_0" value="0"/>
        <value caption="3.3 dBm" name="VAL_1" value="1"/>
        <value caption="2.8 dBm" name="VAL_2" value="2"/>
        <value caption="2.3 dBm" name="VAL_3" value="3"/>
        <value caption="1.8 dBm" name="VAL_4" value="4"/>
        <value caption="1.2 dBm" name="VAL_5" value="5"/>
        <value caption="0.5 dBm" name="VAL_6" value="6"/>
        <value caption="-0.5 dBm" name="VAL_7" value="7"/>
        <value caption="-1.5 dBm" name="VAL_8" value="8"/>
        <value caption="-2.5 dBm" name="VAL_9" value="9"/>
        <value caption="-3.5 dBm" name="VAL_10" value="10"/>
        <value caption="-4.5 dBm" name="VAL_11" value="11"/>
        <value caption="-6.5 dBm" name="VAL_12" value="12"/>
        <value caption="-8.5 dBm" name="VAL_13" value="13"/>
        <value caption="-11.5 dBm" name="VAL_14" value="14"/>
        <value caption="-16.5 dBm" name="VAL_15" value="15"/>
      </value-group>
      <value-group caption="" name="RX_CRC_VALID_bitf">
        <value caption="CRC (FCS) not valid" name="CRC_INVALID" value="0"/>
        <value caption="CRC (FCS) valid" name="CRC_VALID" value="1"/>
      </value-group>
      <value-group caption="" name="RSSI_VALUE_BITF">
        <value caption="Minimum RSSI value: P(RF) &lt; -90 dBm" name="RSSI_MIN" value="0"/>
        <value caption="P(RF) = RSSI_BASE_VAL+3 · (RSSI-1) [dBm]" name="RSSI_MIN_PLUS_3dB" value="1"/>
        <value caption="..." name="VAL_2" value="2"/>
        <value caption="Maximum RSSI value: P(RF) ≥ -10 dBm" name="RSSI_MAX" value="28"/>
      </value-group>
      <value-group caption="" name="ED_LEVEL_BITF">
        <value caption="Minimum result of last ED measurement" name="ED_MIN" value="0x00"/>
        <value caption="P(RF) = RSSI_BASE_VAL+ED [dBm]" name="ED_MIN_PLUS_1dB" value="0x01"/>
        <value caption="..." name="VAL_0x02" value="0x02"/>
        <value caption="Maximum result of last ED measurement" name="ED_MAX" value="0x54"/>
        <value caption="Reset value" name="ED_RESET" value="0xFF"/>
      </value-group>
      <value-group caption="" name="CCA_MODE_bitf">
        <value caption="Mode 3a, Carrier sense OR energy above threshold" name="CCA_CS_OR_ED" value="0"/>
        <value caption="Mode 1, Energy above threshold" name="CCA_ED" value="1"/>
        <value caption="Mode 2, Carrier sense only" name="CCA_CS" value="2"/>
        <value caption="Mode 3b, Carrier sense AND energy above threshold" name="CCA_CS_AND_ED" value="3"/>
      </value-group>
      <value-group caption="" name="CHANNEL_bitf">
        <value caption="2405 MHz" name="F_2405MHZ" value="11"/>
        <value caption="2410 MHz" name="F_2410MHZ" value="12"/>
        <value caption="2415 MHz" name="F_2415MHZ" value="13"/>
        <value caption="2420 MHz" name="F_2420MHZ" value="14"/>
        <value caption="2425 MHz" name="F_2425MHZ" value="15"/>
        <value caption="2430 MHz" name="F_2430MHZ" value="16"/>
        <value caption="2435 MHz" name="F_2435MHZ" value="17"/>
        <value caption="2440 MHz" name="F_2440MHZ" value="18"/>
        <value caption="2445 MHz" name="F_2445MHZ" value="19"/>
        <value caption="2450 MHz" name="F_2450MHZ" value="20"/>
        <value caption="2455 MHz" name="F_2455MHZ" value="21"/>
        <value caption="2460 MHz" name="F_2460MHZ" value="22"/>
        <value caption="2465 MHz" name="F_2465MHZ" value="23"/>
        <value caption="2470 MHz" name="F_2470MHZ" value="24"/>
        <value caption="2475 MHz" name="F_2475MHZ" value="25"/>
        <value caption="2480 MHz" name="F_2480MHZ" value="26"/>
      </value-group>
